In [1]:
import sqlite3
import pandas as pd
import os
from tabulate import tabulate # para ver mejor las filas y columnas cuando hagamos el head de cada tabla.

In [3]:
# Ruta al archivo .sqlite
ruta_db = 'travel.sqlite'

In [4]:
# Conectar a la base de datos
conexion = sqlite3.connect(ruta_db)

In [5]:
# Obtener los nombres de las tablas en la base de datos
cursor = conexion.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tablas = cursor.fetchall()

In [6]:
# Convertir la lista de tablas en un formato legible
nombres_tablas = [tabla[0] for tabla in tablas]

In [7]:
print(nombres_tablas)

['aircrafts_data', 'airports_data', 'boarding_passes', 'bookings', 'flights', 'seats', 'ticket_flights', 'tickets']

In [8]:
aircrafts_data = pd.read_sql_query(f"SELECT * FROM aircrafts_data", conexion)
airports_data = pd.read_sql_query(f"SELECT * FROM airports_data", conexion)
boarding_passes = pd.read_sql_query(f"SELECT * FROM boarding_passes", conexion)
bookings = pd.read_sql_query(f"SELECT * FROM bookings", conexion)
flights = pd.read_sql_query(f"SELECT * FROM flights", conexion)
seats = pd.read_sql_query(f"SELECT * FROM seats", conexion)
ticket_flights = pd.read_sql_query(f"SELECT * FROM ticket_flights", conexion)
tickets = pd.read_sql_query(f"SELECT * FROM tickets", conexion)

In [9]:
aircrafts_data.to_csv("aircrafts_data.csv", index=False)
airports_data.to_csv("airports_data.csv", index=False)
boarding_passes.to_csv("boarding_passes.csv", index=False)
bookings.to_csv("bookings.csv", index=False)
flights.to_csv("flights.csv", index=False)
seats.to_csv("seats.csv", index=False)
ticket_flights.to_csv("ticket_flights.csv", index=False)
tickets.to_csv("tickets.csv", index=False)

### Hasta aca tengo guardados los csv. A partir de aca, leer los archivos cvs ya que voy a borrar el .sqlite porque es muy pesado y no sube al github.

In [2]:
aircrafts_data = pd.read_csv("aircrafts_data.csv")
airports_data = pd.read_csv("airports_data.csv")
boarding_passes = pd.read_csv("boarding_passes.csv")
bookings = pd.read_csv("bookings.csv")
flights = pd.read_csv("flights.csv")
seats = pd.read_csv("seats.csv")
ticket_flights = pd.read_csv("ticket_flights.csv")
tickets = pd.read_csv("tickets.csv")

### Vamos a ir obteniendo información y un pantallazado de los datos que tenemos

#### AIRCRAFTS

In [3]:
aircrafts_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   aircraft_code  9 non-null      object
 1   model          9 non-null      object
 2   range          9 non-null      int64
dtypes: int64(1), object(2)
memory usage: 344.0+ bytes

In [4]:
aircrafts_data.head()

  aircraft_code                                              model  range
0           773    {"en": "Boeing 777-300", "ru": "Боинг 777-300"}  11100
1           763    {"en": "Boeing 767-300", "ru": "Боинг 767-300"}   7900
2           SU9  {"en": "Sukhoi Superjet-100", "ru": "Сухой Суп...   3000
3           320  {"en": "Airbus A320-200", "ru": "Аэробус A320-...   5700
4           321  {"en": "Airbus A321-200", "ru": "Аэробус A321-...   5600

#### AIRPORTS

In [5]:
airports_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104 entries, 0 to 103
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   airport_code  104 non-null    object
 1   airport_name  104 non-null    object
 2   city          104 non-null    object
 3   coordinates   104 non-null    object
 4   timezone      104 non-null    object
dtypes: object(5)
memory usage: 4.2+ KB

In [6]:
airports_data.head()

,airport_code,airport_name,city,coordinates,timezone
0,YKS,"{""en"": ""Yakutsk Airport"", ""ru"": ""Якутск""}","{""en"": ""Yakutsk"", ""ru"": ""Якутск""}","(129.77099609375,62.0932998657226562)",Asia/Yakutsk
1,MJZ,"{""en"": ""Mirny Airport"", ""ru"": ""Мирный""}","{""en"": ""Mirnyj"", ""ru"": ""Мирный""}","(114.03900146484375,62.534698486328125)",Asia/Yakutsk
2,KHV,"{""en"": ""Khabarovsk-Novy Airport"", ""ru"": ""Хабар...","{""en"": ""Khabarovsk"", ""ru"": ""Хабаровск""}","(135.18800354004,48.5279998779300001)",Asia/Vladivostok
3,PKC,"{""en"": ""Yelizovo Airport"", ""ru"": ""Елизово""}","{""en"": ""Petropavlovsk"", ""ru"": ""Петропавловск-К...","(158.453994750976562,53.1679000854492188)",Asia/Kamchatka
4,UUS,"{""en"": ""Yuzhno-Sakhalinsk Airport"", ""ru"": ""Хом...","{""en"": ""Yuzhno-Sakhalinsk"", ""ru"": ""Южно-Сахали...","(142.718002319335938,46.8886985778808594)",Asia/Sakhalin

#### BOARDING PASSES

In [7]:
boarding_passes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 579686 entries, 0 to 579685
Data columns (total 4 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   ticket_no    579686 non-null  int64
 1   flight_id    579686 non-null  int64
 2   boarding_no  579686 non-null  int64
 3   seat_no      579686 non-null  object
dtypes: int64(3), object(1)
memory usage: 17.7+ MB

In [8]:
boarding_passes.head()

    ticket_no  flight_id  boarding_no seat_no
0  5435212351      30625            1      2D
1  5435212386      30625            2      3G
2  5435212381      30625            3      4H
3  5432211370      30625            4      5D
4  5435212357      30625            5     11A

#### BOOKING

In [9]:
bookings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 262788 entries, 0 to 262787
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   book_ref      262788 non-null  object
 1   book_date     262788 non-null  object
 2   total_amount  262788 non-null  int64
dtypes: int64(1), object(2)
memory usage: 6.0+ MB

In [10]:
bookings.head()

  book_ref               book_date  total_amount
0   00000F  2017-07-05 03:12:00+03        265700
1   000012  2017-07-14 09:02:00+03         37900
2   000068  2017-08-15 14:27:00+03         18100
3   000181  2017-08-10 13:28:00+03        131800
4   0002D8  2017-08-07 21:40:00+03         23600

#### FLIGHTS

In [11]:
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33121 entries, 0 to 33120
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   flight_id            33121 non-null  int64
 1   flight_no            33121 non-null  object
 2   scheduled_departure  33121 non-null  object
 3   scheduled_arrival    33121 non-null  object
 4   departure_airport    33121 non-null  object
 5   arrival_airport      33121 non-null  object
 6   status               33121 non-null  object
 7   aircraft_code        33121 non-null  object
 8   actual_departure     33121 non-null  object
 9   actual_arrival       33121 non-null  object
dtypes: int64(1), object(9)
memory usage: 2.5+ MB

In [12]:
flights.head()

,flight_id,flight_no,scheduled_departure,scheduled_arrival,departure_airport,arrival_airport,status,aircraft_code,actual_departure,actual_arrival
0,1185,PG0134,2017-09-10 09:50:00+03,2017-09-10 14:55:00+03,DME,BTK,Scheduled,319,\N,\N
1,3979,PG0052,2017-08-25 14:50:00+03,2017-08-25 17:35:00+03,VKO,HMA,Scheduled,CR2,\N,\N
2,4739,PG0561,2017-09-05 12:30:00+03,2017-09-05 14:15:00+03,VKO,AER,Scheduled,763,\N,\N
3,5502,PG0529,2017-09-12 09:50:00+03,2017-09-12 11:20:00+03,SVO,UFA,Scheduled,763,\N,\N
4,6938,PG0461,2017-09-04 12:25:00+03,2017-09-04 13:20:00+03,SVO,ULV,Scheduled,SU9,\N,\N

#### SEATS

In [13]:
seats.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1339 entries, 0 to 1338
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   aircraft_code    1339 non-null   object
 1   seat_no          1339 non-null   object
 2   fare_conditions  1339 non-null   object
dtypes: object(3)
memory usage: 31.5+ KB

In [14]:
seats.head()

  aircraft_code seat_no fare_conditions
0           319      2A        Business
1           319      2C        Business
2           319      2D        Business
3           319      2F        Business
4           319      3A        Business

#### TICKET FLIGHTS

In [15]:
ticket_flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1045726 entries, 0 to 1045725
Data columns (total 4 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   ticket_no        1045726 non-null  int64
 1   flight_id        1045726 non-null  int64
 2   fare_conditions  1045726 non-null  object
 3   amount           1045726 non-null  int64
dtypes: int64(3), object(1)
memory usage: 31.9+ MB

In [16]:
ticket_flights.head()

    ticket_no  flight_id fare_conditions  amount
0  5432159776      30625        Business   42100
1  5435212351      30625        Business   42100
2  5435212386      30625        Business   42100
3  5435212381      30625        Business   42100
4  5432211370      30625        Business   42100

#### TICKETS

In [17]:
tickets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 366733 entries, 0 to 366732
Data columns (total 3 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   ticket_no     366733 non-null  int64
 1   book_ref      366733 non-null  object
 2   passenger_id  366733 non-null  object
dtypes: int64(1), object(2)
memory usage: 8.4+ MB

In [18]:
tickets.head()

    ticket_no book_ref passenger_id
0  5432000987   06B046  8149 604011
1  5432000988   06B046  8499 420203
2  5432000989   E170C3  1011 752484
3  5432000990   E170C3  4849 400049
4  5432000991   F313DD  6615 976589